int main() {
    unsigned char num[6] = "+11", otvet[17]; // + 010 010 100 001
    if (num[0] == '+')
        otvet[0] = '+';
    else
        otvet[0] = '-';
    for (int i = 1; i < 5; i++) {
        if (num[i] == 0) continue;
        otvet[(i - 1) * 3 + 1] = '0' + (num[i] - '0') / 4; // правильный перевод числа в двоичную СС
        otvet[(i - 1) * 3 + 2] = '0' + ((num[i] - '0') % 4) / 2; // правильный перевод числа в двоичную СС
        otvet[(i - 1) * 3 + 3] = '0' + (num[i] - '0') % 2; // правильный перевод числа в двоичную СС
    }

    otvet[13] = '\0';
}
